#+TITLE: Learning Julia

* Setup your project env

- specific a project name with *project="dev/MIT-18S191"* in ./devshell.toml.
- use *nix develop* or *direnv* enter the devshell.

* Julia Version
#+begin_src julia :async :exports both :results output
versioninfo()
#+end_src

#+RESULTS:
: Julia Version 1.9.1
: Commit 147bdf428cd (2023-06-07 08:27 UTC)
: Platform Info:
:   OS: Linux (x86_64-linux-gnu)
:   CPU: 12 × Intel(R) Core(TM) i7-8700K CPU @ 3.70GHz
:   WORD_SIZE: 64
:   LIBM: libopenlibm
:   LLVM: libLLVM-14.0.6 (ORCJIT, skylake)
:   Threads: 1 on 12 virtual cores


* Julia Test
#+begin_src julia :async :exports both :results output
[zeros(Int, 2, 2) [1; 2]
[3 4] 5]
#+end_src

#+RESULTS:
: 3×3 Matrix{Int64}:
:  0  0  1
:  0  0  2
:  3  4  5

* materials
